import numpy as np
# impedance
channels = ['Fpz', 'Fp1', 'Fp2', 'Fz',  'F3', 'F4',  'F6', 'F7', 'F8',  'FCz',  'Cz',  'C3', 'C4',  'T7', 'T8',  'Pz',  'P3', 'P4',  'P7', 'P8',  'Oz', 'O1', 'O2']
flag_channels = np.zeros(21) # 选择导联位置


impedance_max = 10
impedance_min = 0

impedance_range = [5, 10, 15, 20, 35, 50, 75, 100, 200, 300, 400, 500]   #<5kΩ优秀 5–10kΩ正常  10–20kΩ偏高   20-50kΩ建议调整   >50kΩ异常
impedance_color = [
    [0, 102, 255],   # <=5    蓝色

    [0, 255, 0],     # 10     绿色

    [180, 255, 0],   # 15     黄绿
    [255, 255, 0],   # 20     黄色

    [255, 210, 0],   # 35     黄橙
    [255, 165, 0],   # 50     橙色

    [255, 140, 0],   # 75     红
    [255, 105, 0],    # 100

    [255, 75, 0],    # 200
    [255, 60, 0],    # 300

    [255, 25, 0],     # 400
    [255, 0, 0],     # 500    红色
    [180, 0, 0],     # >500    深红
]
# filter
notch_freq = 50 # 陷波频率
low_cutoff = 4 # 带通滤波器的低频截止频率
high_cutoff = 90 # 带通滤波器的高频截止频率